import datetime
from sys import flags
from time import time

currentTime = datetime.datetime.now().strftime('%H:%M')
h = int(currentTime[0:2])
m = int(currentTime[3:5])

d = {
    1:['один', 'одна', 'первого'],
    2:['два', 'две', 'второго'],
    3:['три', 'три', 'третьего'],
    4:['четыре', 'четыре', 'четвертого'],
    5:['пять', 'пять', 'пятого'],
    6:['шесть', 'шесть', 'шестого'],
    7:['семь', 'семь', 'седьмого'],
    8:['восемь', 'восемь', 'восьмого'],
    9:['девять', 'девять', 'девятого'],
    10:['десять', 'десять', 'десятого'],
    11:['одиннадцать', 'одиннадцать', 'одиннадцатого'],
    12:['двенадцать', 'двенадцать', 'двенадцатого'],
    13:['один', 'тринадцать', 'первого'],
    14:['два', 'четырнадцать', 'второго'],
    15:['три', 'пятнадцать', 'третьего'],
    16:['четыре', 'шестнадцать', 'четвертого'],
    17:['пять', 'семнадцать', 'пятого'],
    18:['шесть', 'восемнадцать', 'шестого'],
    19:['семь', 'девятнадцать', 'седьмого'],
    20:['восемь', 'двадцать', 'восьмого'],
    21:['девять', 'двадцать одна', 'девятого'],
    22:['десять', 'двадцать две', 'десятого'],
    23:['одиннадцать', 'двадцать три', 'одиннадцатого'],
    24:['двенадцать', 'двадцать четыре', 'двенадцатого'],
    25:['','двадцать пять'],
    26:['','двадцать шесть'],
    27:['','двадцать семь'],
    28:['','двадцать восемь'],
    29:['','двадцать девять'],
    30:['половина'],
    31:['','тридцать одна'],
    32:['','тридцать две'],
    33:['','тридцать три'],
    34:['','тридцать четыре'],
    35:['','тридцать пять'],
    36:['','тридцать шесть'],
    37:['','тридцать семь'],
    38:['','тридцать восемь'],
    39:['','тридцать девять'],
    40:['','сорок'],
    41:['','сорок одна'],
    42:['','сорок две'],
    43:['','сорок три'],
    44:['','сорок четыре'],
    45:['пятнадцати'],
    46:['четырнадцати'],
    47:['тринадцати'],
    48:['двенадцати'],
    49:['одинадцаати'],
    50:['десяти'],
    51:['девяти'],
    52:['восьми'],
    53:['семи'],
    54:['шести'],
    55:['пяти'],
    56:['четырех'],
    57:['трех'],
    58:['двух'],
    59:['одной'],
    0:['полночь']}

while True:
    ask1 = input('Хотите узнать текущее время? (yes/y or not/n): \n')
    if ask1 == 'yes' or ask1 == 'y' or ask1 == 'not' or ask1 == 'n':
        break
    else:
        print('Ответьте на вопрос верно!\n')

def timeInWords(h,m):
    if ask1 == 'yes' or ask1 == 'y':
        flag = 'Сейчас'
    if ask1 == 'not' or ask1 == 'n':
        flag = 'Ваше время:'
    
    if (h == 00 or h == 0) and (m == 00 or m == 0):
        print(f"{flag} {d[0][0]}")
    if m == 0:
        if h == 1 or h == 13:
            print(f"{flag} {d[h][0]} час ровно.")
        if (h >= 2 and h <= 4) or (h >= 14 and h <= 16): 
            print(f"{flag} {d[h][0]} часа ровно.")
        if (h >= 5 and h <= 12) or (h >= 17 and h <= 24): 
            print(f"{flag} {d[h][0]} часов ровно.")
    if m == 1 or m == 31 or m == 41 or m == 21:
        print(f"{flag} {d[m][1]} минута {d[h+1][2]}.")
    if (m >= 2 and m <= 4) or (m >= 22 and m <= 24) or (m >= 32 and m <= 34) or (m >= 42 and m <= 44):
        print(f"{flag} {d[m][1]} минуты {d[h+1][2]}.")
    if (m >= 5 and m <= 20) or (m >= 25 and m <=29) or (m >= 35 and m <=40):
        print(f"{flag} {d[m][1]} минут {d[h+1][2]}.") 
    if m == 30:
        print(f"{flag} {d[30][0]} {d[h+1][2]}.")
    if m >= 45 and m <= 59:
        print(f"{flag} без {d[m][0]} минут {d[h+1][2]}.")

if ask1 == 'yes' or ask1 == 'y':
    timeInWords(h, m)
elif ask1 == 'not' or ask1 == 'n':
    userTime = input('Введите время в формате hh:mm: \n')
    h = int(userTime[0:2])
    m = int(userTime[3:5])
    timeInWords(h,m)
else:
    print("Как Вы взломали цикл?")