from datetime import datetime

d =  {1:['один', 'одна', 'первого'], 2:['два', 'две', 'второго'], 3:['три', 'три', 'третьего'], 4:['четыре', 'четыре', 'четвертого'],
5:['пять', 'пять', 'пятого'], 6:['шесть', 'шесть', 'шестого'], 7:['семь', 'семь', 'седьмого'], 8:['восемь', 'восемь', 'восьмого'],
9:['девять', 'девять', 'девятого'], 10:['десять', 'десять', 'десятого'], 11:['одиннадцать', 'одиннадцать', 'одиннадцатого'],
12:['двенадцать', 'двенадцать', 'двенадцатого'], 13:['один', 'тринадцать', 'первого'], 14:['два', 'четырнадцать', 'второго'], 
15:['три', 'пятнадцать', 'третьего'], 16:['четыре', 'шестнадцать', 'четвертого'], 17:['пять', 'семнадцать', 'пятого'],
18:['шесть', 'восемнадцать', 'шестого'], 19:['семь', 'девятнадцать', 'седьмого'], 20:['восемь', 'двадцать', 'восьмого'],
21:['девять', 'двадцать одна', 'девятого'], 22:['десять', 'двадцать две', 'десятого'], 23:['одиннадцать', 'двадцать три', 'одиннадцатого'],
24:['двенадцать', 'двадцать четыре', 'двенадцатого'], 25:['','двадцать пять'], 26:['','двадцать шесть'], 27:['','двадцать семь'],
28:['','двадцать восемь'], 29:['','двадцать девять'], 30:['половина'], 31:['','тридцать одна'], 32:['','тридцать две'], 33:['','тридцать три'], 
34:['','тридцать четыре'], 35:['','тридцать пять'], 36:['','тридцать шесть'], 37:['','тридцать семь'], 38:['','тридцать восемь'], 
39:['','тридцать девять'], 40:['','сорок'], 41:['','сорок одна'], 42:['','сорок две'], 43:['','сорок три'], 44:['','сорок четыре'],
45:['пятнадцати'], 46:['четырнадцати'], 47:['тринадцати'], 48:['двенадцати'], 49:['одиннадцати'], 50:['десяти'], 51:['девяти'], 52:['восьми'], 53:['семи'], 
54:['шести'], 55:['пяти'], 56:['четырех'], 57:['трех'], 58:['двух'], 59:['одной'], 0:['', 'полночь']}


a = int(input('Please input 1 if you want to enter your time, 2 if you want to see the real time:\n'))
if a == int(2):
    time_now = datetime.now().strftime("%H:%M").replace(':', '')
    h = int(time_now[:2])
    m = int(time_now[2:]) 
if a == int(1):
    your_time = input('Input your time in format HH:MM:\n')
    if ":" not in your_time or len (your_time) != 5: 
        print ("Incorrectly time! Try again!") 
    h, m = your_time.split(":")
    h = int(h) 
    m = int(m) 
if m == 0: 
    if h == 1 or h == 13: 
        print(f"{d[h][0]} час ровно") 
    elif h >= 5 and h <= 12:  
        print(f"{d[h][0]} часов ровно") 
    elif h >= 17 and h <= 24:  
        print(f"{d[h][0]} часов ровно") 
    elif h == 0: 
        print(f"{d[h][0]} полночь") 
    else: 
        print(f"{d[h][0]} часа ровно") 
if m >= 2 and m <= 4:
        print(f'{d[m][1]} минуты {d[h+1][2]}') 
if m >= 22 and m <= 24:  
        print(f'{d[m][1]} минуты {d[h+1][2]}') 
if m >= 32 and m <= 34:  
        print(f'{d[m][1]} минуты {d[h+1][2]}')             
if m >= 42 and m <= 44:  
        print(f'{d[m][1]} минуты {d[h+1][2]}') 
if m >= 5 and m <= 20: 
        print(f'{d[m][1]} минут {d[h+1][2]}')
if m >= 25 and m < 30: 
        print(f'{d[m][1]} минут {d[h+1][2]}')
if m >= 35 and m <= 40: 
        print(f'{d[m][1]} минут {d[h+1][2]}')  
if m == 30:
        print(f'{d[30][0]} {d[h+1][2]}')
if m ==1 or m == 21 or m == 31 or m == 41:
        print(f'{d[m][1]} минута {d[h+1][2]}')
if m >= 45 and m < 59:
        print(f'без {d[m][0]} минут {d[h+1][0]}')
if m == 59:
        print (f'без {d[m][0]} минуты {d[h+1][0]}')      
if m == 0 and h == 0:
        print(d[0][0])
        
    
    
 
    